{
    "faction":"Crusader",
    "cards": [
        {
            "name": "Prince of Dawn",
            "effect": {
                "command": "Deal damage to the opposing minion equal to the number of cards in its /ancestry/."
            },
            "flavor": "The formidable prince whose technique has proven lethal.",
            "count": 1
        },
        {
            "name": "Balista",
            "effect": {
                "command": "Deals 2 damage to the opposing minion. If this minion is at the outer ranks, deal 2 damage to the minion adjacet to the opposing minion.",
                "switch": "If switching to an outer rank, deal 2 damage to itself."
            },
            "flavor": "A heavy machinery capable of decapacitation, if it hits its mark.",
            "count": 2
        },
        {
            "name": "Quartermaster",
            "effect": {
                "command": "Deal 2 damage to opposing minion",
                "trait": "If this minion is on the outer ranks, whenever a friendly minion activates a /Command/ effect, activate this minion's /Command/ effect.",
                "switch": "After switching, activates the /Command/ effect of the minion it switches with."
            },
            "flavor": "A master strategist with a mean swing.",
            "count": 2
        },
        {
            "name": "Mounted Warbeast",
            "effect": {
                "command": "Deal 2 damage to minions adjacent to the opposing minion."
            },
            "flavor": "Tamed rhinos has proven to be untamed.",
            "count": 2
        },
        {
            "name": "Flagbearer Noah",
            "effect": {
                "command": "Heal this minion by 2.",
                "trait": "Whenever a friendly minion is about to take damage, activate the /Command/ effect of this minion, and change the damaging target to this minion."
            },
            "flavor": "A man of faith among the bloodied hands.",
            "count": 2
        },
        {
            "name": "Militia",
            "effect": {
                "trait": "Whenever this minion is targeted for a /Command/ effect, deal 2 damage to itself.",
                "ancestor": "Whenever this minion activates its /Command/ effect, deal 2 damage to the opposing minion."
            },
            "flavor": "Too brave, too naive.",
            "count": 2
        },
        {
            "name": "Commander",
            "effect": {
                "command": "Deal 1 damage to the opposing minion, then activate the /Command/ effect of the minion on the right, and then the minion on the left."
            },
            "flavor": "He's the commander. You know the rest.",
            "count": 2
        },
        {
            "name": "Heavy Arms",
            "effect": {
                "trait": "Any damage this minion receives will be reduced by 2.",
                "ancestor": "Whenever this minion activates a /Command/ effect, deal 2 damage to itself."
            },
            "flavor": "His gigantic shield can sometimes be a burden.",
            "count": 2
        },
        {
            "name": "Berserker",
            "effect": {
                "command": "Deal 3 damage to the opposing minion, and then deal 2 damage to itself.",
                "ancestor": "Whenever this minion activates a /Command/ effect, deal 2 damage to itself and reshuffle this card."
            },
            "flavor": "Maybe the crusader has ran out of manpower if they need to put this guy in their ranks.",
            "count": 2
        },
        {
            "name": "Golden Wings",
            "effect": {
                "hex": "You can choose to put the top card of this minion's /ancestry/ over this minion (and become the minion). No /Hex/ effect is activated.",
                "ancestor": "When this minion is going to take damage, you can reshuffle this card, then reduce the damage taken to 0."
            },
            "flavor": "Any man with wings is no longer a man.",
            "count": 3
        }
    ],
    "boss": {
        "name": "Zavalion",
        "summon": "When 3 or more /Command/ effects are triggered in within one action (chain), summon on any minion.",
        "return": "Whenever this minion takes any damage.",
        "effect": {
            "command": "Deal 2 damage to the opposing minion.",
            "trait": "Whenever a /Command/ effect is activated anywhere, deal 1 damage to all enemy minions."
        }
    }
}